<?php

//2. Определить сложность следующих алгоритмов.
//   Сколько произойдет итераций ?

//1)
$n = 10000;
$array[] = [];

for ($i = 0; $i < $n; $i++) { //10 000
    for ($j = 1; $j < $n; $j *= 2) { //  14
        $array[$i][$j] = true;
    }
}
//Сложность - О(n) * O(log n) = О(n * log n)
// 140 000 операций

//2)
$n = 10000;
$array[] = [];

for ($i = 0; $i < $n; $i += 2) { //5 000
    for ($j = $i; $j < $n; $j++) { //10 000
        $array[$i][$j] = true;
    }
}

//Сложность - O(n/2) * О(n) = О(n * n)
// 50 000 000 операций
